import React from 'react';

const About: React.FC = () => {
  return (
    <section className="font-['IBM Plex Sans Arabic'] min-h-screen w-full py-16 px-20 bg-white text-black text-right">
      <h2 className="text-[128px] font-bold leading-tight mb-20 text-black">من نحن؟</h2>
      <p className="text-[20px] font-normal leading-relaxed max-w-[900px] mx-auto">
        بعد أشهر من العمل الجاد والتخطيط، 
        أُطلقت ساكورا في البداية كموقع بسيط يتيح للمصورين عرض أعمالهم ومشاركة تجاربهم. سرعان ما لاقت المنصة إقبالاً واسعاً من المصورين الذين وجدوا فيها المكان المثالي للتواصل والنمو.
        مع مرور الوقت، تطورت ساكورا لتشمل خدمات متنوعة، مثل أدوات التحرير المتقدمة، الدروس التعليمية، والمسابقات
        الدورية. أصبحت المنصة وجهة رئيسية للمصورين الذين يبحثون عن بيئة محفزة تدعم طموحاتهم الفنية.
        اليوم، تفتخر ساكورا بأنها موطن
        لآلاف المصورين من مختلف أنحاء العالم، وتواصل السعي لتقديم الأفضل لمجتمعها من خلال الابتكار والتطور المستمر. ما بدأ كحلم صغير في ذهن مجموعة من الأصدقاء، تحول إلى منصة رائدة تجمع بين الشغف، الإبداع، والتعاون.
      </p>
    </section>
  );
};

export default About;
